# Intro to Dataframes

In [3]:
import pandas as pd

In [57]:
df = pd.DataFrame([[1,2,3], [4,5,6], [7,8,9], [10,11,12]], columns=["A", "B", "C"], index=["x", "y", "z", "Zz"])

In [59]:
df.head()

     A   B   C
x    1   2   3
y    4   5   6
z    7   8   9
Zz  10  11  12

In [61]:
df.tail()

     A   B   C
x    1   2   3
y    4   5   6
z    7   8   9
Zz  10  11  12

In [63]:
df.columns

Index(['A', 'B', 'C'], dtype='object')

In [65]:
df.index.tolist()

['x', 'y', 'z', 'Zz']

In [67]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, x to Zz
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       4 non-null      int64
 1   B       4 non-null      int64
 2   C       4 non-null      int64
dtypes: int64(3)
memory usage: 128.0+ bytes

In [69]:
df.describe()

               A          B          C
count   4.000000   4.000000   4.000000
mean    5.500000   6.500000   7.500000
std     3.872983   3.872983   3.872983
min     1.000000   2.000000   3.000000
25%     3.250000   4.250000   5.250000
50%     5.500000   6.500000   7.500000
75%     7.750000   8.750000   9.750000
max    10.000000  11.000000  12.000000

In [71]:
df.nunique()

A    4
B    4
C    4
dtype: int64

In [73]:
df['A'].unique()

array([ 1,  4,  7, 10], dtype=int64)

In [75]:
df.shape

(4, 3)

In [79]:
df.size

12

https://www.youtube.com/watch?v=2uvysYbKdjM

9:00 부터